---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionRotY
source: html/b8d4aabf-f11d-e1ee-2990-9042c0e58a11.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionRotY Property

"Y Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryDirectionRotY { get; }
```